[
  {
    "id": "p1",
    "name": "Ahmad ibn Ibrahim al-Ghazi",
    "title": "Imam of Adal",
    "period": "1506 - 1543",
    "location": [9.3, 42.1],
    "startYear": 1506,
    "endYear": 1543,
    "image": "https://pbs.twimg.com/media/Fx19qvuaIAEEhNS.jpg",
    "summary": "Known to Ethiopians as 'Gragn' (the Left-Handed), Ahmad ibn Ibrahim al-Ghazi was the charismatic Imam of the Adal Sultanate who transformed the regional conflict into a jihad that nearly overthrew the Ethiopian Empire. With Ottoman support including firearms and artillery, he won a series of victories from 1529-1543, destroying churches, monasteries, and much of Ethiopia's medieval heritage. His conquests, which reached as far north as Tigray, created a Muslim administration that temporarily governed much of Ethiopia. His death at Wayna Daga in 1543 from a Portuguese musket shot marked the turning point of the war and saved the Solomonic dynasty from extinction."
  },
  {
    "id": "p2",
    "name": "Taytu Betul",
    "title": "Consort of Ethiopia",
    "period": "1889 - 1913",
    "location": [9.03, 38.74],
    "startYear": 1889,
    "endYear": 1913,
    "image": "https://i0.wp.com/www.historyofroyalwomen.com/wp-content/uploads/Taytu_Betul-scaled1.jpg?fit=1473%2C1004&ssl=1",
    "summary": "Taytu Betul (c. 1851–1918) was not merely Emperor Menelik II's wife but his most influential political partner and one of Ethiopia's most formidable rulers. Descended from Oromo and Amhara nobility, she played decisive roles in diplomacy, administration, and military strategy. She famously opposed the Treaty of Wuchale, recognizing its colonial implications, and helped mobilize forces for the Battle of Adwa. As founder of Addis Ababa ('New Flower'), she shaped Ethiopia's modern capital. Her political network through relatives and allies created a powerful governing structure, and her management of the imperial court maintained stability during Menelik's illnesses. Her influence declined after 1910, but her legacy as a nation-builder endures."
  },
  {
    "id": "p3",
    "name": "Ras Makonnen Wolde Mikael",
    "title": "Governor of Harar, Military Commander",
    "period": "1852 - 1906",
    "location": [9.03, 38.74],
    "startYear": 1852,
    "endYear": 1906,
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT7boG4RYKeNZTgVlds5SMOFREiJYrZLCc9og&s",
    "summary": "Ras Makonnen (1852–1906), father of Emperor Haile Selassie, was Emperor Menelik II's cousin and one of Ethiopia's most capable modernizers. As governor of Harar after its 1887 conquest, he transformed the historic Islamic city into a model province, balancing respect for local traditions with imperial administration. At the Battle of Adwa, he commanded the center of Ethiopia's army. His diplomatic missions to Europe, particularly Italy and France, secured modern weapons and international recognition. He pioneered modern education by sending Ethiopian students abroad, including his son Tafari. His death at 54 removed a stabilizing figure whose progressive vision influenced Ethiopia's early 20th-century development."
  },
  {
    "id": "p4",
    "name": "Ras Alula Engida",
    "title": "Military Commander, Governor of Tigray",
    "period": "1847 - 1897",
    "location": [14.1, 38.7],
    "startYear": 1847,
    "endYear": 1897,
    "image": "https://zantana.net/static/d73d211262fde914d23b36353d90a117/2b365/ras_alula_engida.jpg",
    "summary": "Known as 'Abba Nega' (father of wisdom), Ras Alula (1847–1897) rose from humble origins to become Emperor Yohannes IV's greatest general and Ethiopia's most brilliant strategist. His victory at Dogali (1887) annihilated an Italian column, proving Ethiopian military capability. At Adwa, his Tigrayan forces formed the vanguard that broke Italian lines. Beyond battlefield success, he governed difficult frontier regions, defended against Mahdist incursions, and maintained northern unity. His loyalty transferred to Menelik II after Yohannes's death, helping preserve national cohesion. Killed fighting Mahdists at the Battle of Amba Alagi, he is remembered as Ethiopia's 'Garibaldi'—a nationalist hero who defended sovereignty against multiple foreign threats."
  },
  {
    "id": "p5",
    "name": "Abuna Petros",
    "title": "Bishop, Martyr",
    "period": "1892 - 1936",
    "location": [9.03, 38.74],
    "startYear": 1892,
    "endYear": 1936,
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcS7etkIf44RZziEkQYKgyok_ybgtWQ9VrFfAQ&s",
    "summary": "Abuna Petros (1892–1936), Ethiopia's most celebrated martyr, was executed by Italian forces for refusing to collaborate with the occupation. As bishop of Wollo, he used his pulpit to inspire resistance, famously declaring: 'The cry of my countrymen who die on the battlefield and the lament of mothers and orphans reach heaven. God will give Ethiopia victory.' Captured after the fall of Addis Ababa, he refused demands to order Patriots to surrender. Before his public execution at Siddist Kilo in July 1936, he blessed the crowd and forgave his executioners. His martyrdom became a powerful symbol of Ethiopian resistance, inspiring the Patriots' movement and cementing the Ethiopian Orthodox Church's role as a guardian of national identity."
  },
  {
    "id": "p6",
    "name": "Gragn Mohammed",
    "title": "Military Leader, Imam",
    "period": "1527 - 1543",
    "location": [9.3, 42.1],
    "startYear": 1527,
    "endYear": 1543,
    "image": "https://cdn.britannica.com/44/163144-004-0D8EB23C/Ahmad-Gran-statue-Mogadishu-Somalia.jpg?w=400&h=300&c=crop",
    "summary": "Gragn Mohammed (Ahmad ibn Ibrahim al-Ghazi) transformed the Ethiopian-Adal conflict from border skirmishes into an existential religious war. His military innovations—importing Ottoman firearms, using light cavalry effectively, and employing siege tactics—revolutionized warfare in the Horn. Between 1529-1543, his forces controlled three-quarters of the Ethiopian highlands, destroying ancient churches like Debre Libanos and Aksum's Maryam Tsion. While Ethiopian sources depict him as a destroyer, Arab chronicles praise his piety and justice. His legacy is complex: he nearly destroyed Christian Ethiopia but inadvertently strengthened it by forcing military modernization and creating a unifying national trauma that would shape Ethiopian identity for centuries."
  },
  {
    "id": "p7",
    "name": "Ras Gobena Dacche",
    "title": "Military Commander, Unifier",
    "period": "1821 - 1889",
    "location": [8.5, 37.5],
    "startYear": 1821,
    "endYear": 1889,
    "image": "https://img.sewasew.com/definitions/ff2fce9611ea47d0a7f3446bbdd26c6b_408_300",
    "summary": "Ras Gobena (1821–1889), an Oromo military genius, was Menelik II's most important commander during Ethiopia's southern expansion. His campaigns from 1875-1889 incorporated the Gibe kingdoms, Sidama, Wolayta, and Kaffa into the empire, doubling its size. Unlike earlier conquerors, Gobena often negotiated settlements that preserved local elites' status if they submitted peacefully. His Oromo heritage facilitated integration of Oromo regions, though resistance like at Wolayta required brutal sieges. He established administrative systems that Menelik later adopted empire-wide. His loyalty never wavered despite opportunities to rebel, making him indispensable to Ethiopia's modernization. He died months before Adwa, but his conquered territories provided resources and troops for Ethiopia's victory."
  },
  {
    "id": "p8",
    "name": "Zewditu I",
    "title": "Empress of Ethiopia",
    "period": "1916 - 1930",
    "location": [9.03, 38.74],
    "startYear": 1916,
    "endYear": 1930,
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRbTeyCtRV336FvdEX5oacSzAj2wiWw6UBi-w&s",
    "summary": "Empress Zewditu (1876–1930), Menelik II's daughter, was modern Africa's first female head of state—a conservative monarch navigating rapid modernization. Her reign with Ras Tafari as regent created a delicate diarchy: she represented traditional values and the Church while Tafari pursued modernization. Despite personal piety favoring isolationism, she supported Ethiopia's 1923 League of Nations admission. Her reign saw abolition of slavery (1924), infrastructure development, and educational expansion, though she privately worried about Western influence. The 1928 coup attempt against Tafari and her son-in-law's rebellion tested her authority. Her death in 1930, possibly from diabetes, ended an era of transition, allowing Haile Selassie's coronation and accelerated modernization."
  },
  {
    "id": "p9",
    "name": "Ras Tafari Makonnen",
    "title": "Regent, Heir Apparent",
    "period": "1916 - 1930",
    "location": [9.03, 38.74],
    "startYear": 1916,
    "endYear": 1930,
    "image": "https://i.pinimg.com/736x/73/5f/0e/735f0e13f1547b8c550e8158044ce333.jpg",
    "summary": "As Regent (1916-1930), Ras Tafari Makonnen (future Haile Selassie) laid Ethiopia's modern foundations while respecting Empress Zewditu's traditional authority. His 1924 European tour—visiting Jerusalem, Egypt, and multiple European capitals—secured diplomatic recognition and demonstrated Ethiopia's sovereignty. He achieved League of Nations membership (1923), abolished slavery (1924), established the first constitution (1931 precursor), and created modern ministries. His power consolidation—defeating rebellions by Dejazmach Balcha (1928) and Ras Gugsa (1930)—unified the state. Though criticized for centralizing power, his reforms prepared Ethiopia for 20th-century challenges. Crowned Emperor in 1930, his regency transformed Ethiopia from feudal kingdom to modernizing state."
  },
  {
    "id": "p10",
    "name": "Abuna Yesehaq",
    "title": "Archbishop, Diaspora Leader",
    "period": "1928 - 2005",
    "location": [9.03, 38.74],
    "startYear": 1928,
    "endYear": 2005,
    "image": "https://abbayesehaq.com/img/sm_abbaNS.jpg",
    "summary": "Abuna Yesehaq (1928–2005), born Laike Maryam Mandefro, became the Ethiopian Orthodox Tewahedo Church's first Western Hemisphere Archbishop, building a global diaspora community. Ordained in 1971, he served Caribbean communities before being appointed to the U.S. in 1979. He mediated between the Ethiopian Church and Rastafarians, acknowledging spiritual connections while maintaining theological distinctions. His leadership during the Derg era (1974-1991) preserved church unity despite Marxist persecution. He established over 100 churches abroad, promoted Amharic liturgy preservation, and advocated for Ethiopian refugees. His 2005 death marked the passing of a transnational religious leader who bridged Ethiopian tradition with global diaspora realities."
  },
    {
    "id": "p11",
    "name": "Lalibela",
    "title": "King of Zagwe Dynasty",
    "period": "1181 - 1221",
    "location": [12.03, 39.04],
    "startYear": 1181,
    "endYear": 1221,
    "image": "https://i.pinimg.com/736x/df/81/ed/df81ed9192d4533ba6a0fd417469ac34.jpg",
    "summary": "King Lalibela (c. 1181–1221), the most famous ruler of the Zagwe dynasty, commissioned the 11 rock-hewn churches of Lalibela—a UNESCO World Heritage site considered the 'New Jerusalem.' According to tradition, angels helped construct these monolithic churches after Lalibela visited the Holy Land and sought to create a pilgrimage site for Christians unable to reach Jerusalem due to Muslim conquests. His reign marked a golden age of Ethiopian Christianity, with architectural and artistic flourishing. The Church of Saint George, shaped as a perfect cross, remains an engineering marvel. Venerated as a saint in the Ethiopian Orthodox Church, his legacy embodies Ethiopia's unique Christian civilization."
  },
  {
    "id": "p12",
    "name": "Yekuno Amlak",
    "title": "Founder of Solomonic Dynasty",
    "period": "1270 - 1285",
    "location": [9.03, 38.74],
    "startYear": 1270,
    "endYear": 1285,
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR4iMMyi5KAHjVySZ4WcYWwZ-ZYoC8ghNV2zA&s",
    "summary": "Yekuno Amlak (reigned 1270–1285) restored the Solomonic dynasty after overthrowing the Zagwe rulers, claiming direct descent from King Solomon and the Queen of Sheba through the Kebra Nagast. His coronation established the ideological foundation for Ethiopian monarchy for six centuries. He forged critical alliances with the Ethiopian Orthodox Church and regional nobility, moving the capital to Tegulet in Shewa. His reign began the 'Solomonic Restoration' that would produce powerful emperors like Amda Seyon I. While historical details are sparse, his legacy created the dynastic continuity that would define Ethiopia until Haile Selassie's overthrow in 1974."
  },
  {
    "id": "p13",
    "name": "Amda Seyon I",
    "title": "Emperor of Ethiopia",
    "period": "1314 - 1344",
    "location": [12.6, 37.4],
    "startYear": 1314,
    "endYear": 1344,
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQ3PE17oenNNqsYrKor8DBb9o5cWStuqWMdaw&s",
    "summary": "Amda Seyon I (r. 1314–1344), 'Pillar of Zion,' was Ethiopia's first great expansionist emperor, transforming it from a kingdom to an empire. His military campaigns subdued Muslim sultanates (Ifat, Hadiya, Dawaro), Christian rebels, and Beta Israel communities. He established the imperial administration system, appointed regional governors, and expanded trade routes. His chronicles, the earliest detailed Ethiopian royal records, describe campaigns restoring Christian authority. He built churches and monasteries, strengthening Orthodox Christianity. His 30-year reign established the patterns of imperial governance, military organization, and religious patronage that would characterize the Solomonic dynasty for centuries."
  },
  {
    "id": "p14",
    "name": "Zara Yaqob",
    "title": "Emperor of Ethiopia",
    "period": "1434 - 1468",
    "location": [12.6, 37.4],
    "startYear": 1434,
    "endYear": 1468,
    "image": "https://intellectualhistory.web.ox.ac.uk/sites/default/files/styles/mt_image_medium/public/intellectualhistory/images/media/zy_2.jpg?itok=ujpe5-98",
    "summary": "Zara Yaqob (1399–1468), 'Seed of Jacob,' was a philosopher-king who centralized imperial power and enforced religious orthodoxy. He championed the cult of the Virgin Mary, making Saturday (besides Sunday) a day of rest honoring her. His theological treatise 'Matshafa Berhan' (Book of Light) standardized Orthodox doctrine and attacked heresies. He moved the capital to Debre Berhan, built numerous churches, and established royal control over the clergy. While his religious persecutions (against Muslims, Beta Israel, and 'heretical' Christians) were severe, his reign represented Ethiopian civilization's intellectual and artistic peak before the 16th-century crises. His death began a century of dynastic decline."
  },
  {
    "id": "p15",
    "name": "Susenyos I",
    "title": "Emperor of Ethiopia",
    "period": "1607 - 1632",
    "location": [11.85, 38.0],
    "startYear": 1607,
    "endYear": 1632,
    "image": "https://i.ebayimg.com/images/g/BmUAAOSwcK1ZdakL/s-l1200.jpg",
    "summary": "Susenyos I (1572–1632), the 'Catholic Emperor,' converted to Roman Catholicism through Jesuit missionaries, triggering Ethiopia's only major religious civil war. Initially seeking Portuguese military aid against the Oromo expansion, his 1622 official conversion and attempts to impose Catholicism provoked widespread rebellion. The 1628-1632 civil war killed approximately 32,000 people. Recognizing failure, he abdicated in favor of his son Fasilides, declaring: 'I have reduced the kingdom to misery... choose whom you will.' His reign demonstrated Ethiopia's resistance to foreign religious domination and strengthened Orthodox identity. Despite his conversion, he was a capable military leader who temporarily stabilized the empire."
  },
  {
    "id": "p16",
    "name": "Fasilides",
    "title": "Emperor of Ethiopia",
    "period": "1632 - 1667",
    "location": [12.6, 37.4],
    "startYear": 1632,
    "endYear": 1667,
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQu5VyGPck9nfjlOu6tv8pwADnx6Nd2y257Kw&s",
    "summary": "Fasilides (1603–1667) restored Orthodox Christianity after his father Susenyos's Catholic experiment, expelling Jesuits and reestablishing traditional faith. He founded Gondar as Ethiopia's permanent capital, beginning the 'Gondarine Period' (1636–1769) of architectural and cultural renaissance. His castle (Fasil Ghebbi) started the UNESCO-listed Gondar castles. He centralized administration, reformed taxation, and built bridges, churches, and palaces. He negotiated with neighboring Muslim states while defending against Oromo expansion. His 35-year reign provided stability after a century of crises, though his successors would weaken central authority, leading to the Zemene Mesafint (Era of Princes)."
  },
  {
    "id": "p17",
    "name": "Iyasus I",
    "title": "Emperor of Ethiopia",
    "period": "1682 - 1706",
    "location": [12.6, 37.4],
    "startYear": 1682,
    "endYear": 1706,
    "image": "https://img.sewasew.com/definitions/943b23c4aef74ddfb2fce330b10a1713_246_205",
    "summary": "Iyasus I (c. 1682–1706), 'the Great,' was Gondar's most brilliant emperor, whose death triggered the empire's decline. He expanded imperial control over Sidamo, Guragé, and Agaw regions. A skilled administrator, he reformed justice, promoted trade with Red Sea ports, and maintained religious balance. He was a patron of arts—manuscript illumination, music, and church building flourished. His assassination (possibly by his son Tekle Haymanot I) began a century of palace coups, regicides, and feudal fragmentation. European visitors described his sophisticated court and Ethiopia's prosperity. His reign represented the Gondarine civilization's peak before the Zemene Mesafint's chaos."
  },
  {
    "id": "p18",
    "name": "Mikael Sehul",
    "title": "Ras, Power Behind the Throne",
    "period": "1692 - 1779",
    "location": [14.1, 38.7],
    "startYear": 1692,
    "endYear": 1779,
    "image": "https://i.pinimg.com/736x/47/18/5a/47185ab0494dff909061c68605dccec0.jpg",
    "summary": "Mikael Sehul (c. 1692–1779), the Tigrayan ruler who epitomized the Zemene Mesafint ('Era of Princes'), became the first non-royal to effectively control the empire. As Ras of Tigray, he commanded the empire's strongest army. In 1769, he deposed Emperor Iyoas I, installing puppet emperors and ruling from Gondar. His 1769 killing of Iyoas—the first imperial regicide—destroyed the monarchy's sacred aura. Though he temporarily restored order, his dominance provoked Oromo nobility's rebellion, accelerating fragmentation. He symbolizes both the feudal warlordism that weakened Ethiopia and the northern (Tigrayan) power that would repeatedly shape Ethiopian politics."
  },
  {
    "id": "p19",
    "name": "Sahle Selassie",
    "title": "King of Shewa",
    "period": "1813 - 1847",
    "location": [8.5, 39.0],
    "startYear": 1813,
    "endYear": 1847,
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRWjqV17Zz9PJV8I9Lz68ldW74TV-xyp_aHZw&s",
    "summary": "Sahle Selassie (1795–1847), king of Shewa and Menelik II's grandfather, transformed Shewa from a fragmented province into Ethiopia's wealthiest and most powerful region. While the northern empire crumbled during the Zemene Mesafint, he built a centralized state with a modern army, bureaucracy, and capital at Ankober. He expanded southward, incorporating Oromo territories through warfare and diplomacy. He established trade with Red Sea ports, importing firearms that gave Shewa military superiority. His court attracted European missionaries and explorers who documented his sophisticated administration. He refused the imperial title, recognizing northern symbolic authority, but created the power base from which his grandson would reunify Ethiopia."
  },
  {
    "id": "p20",
    "name": "Wube Haile Maryam",
    "title": "Ras of Semien, De facto Ruler",
    "period": "1799 - 1867",
    "location": [13.27, 38.2],
    "startYear": 1799,
    "endYear": 1867,
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bd/Ras_Wulbe_and_his_retinue_%28c._1880%29.png/330px-Ras_Wulbe_and_his_retinue_%28c._1880%29.png",
    "summary": "Wube Haile Maryam (c. 1799–1867), Ras of Semien, controlled northern Ethiopia before Tewodros II's rise. He defeated Ras Ali II's Yejju Oromo regime in 1853, briefly unifying the north. His alliance with British explorers seeking the Nile's source brought modern weapons and European attention. In 1855, he crowned Kassa Hailu (Tewodros II) as emperor, expecting to control him, but was defeated and imprisoned at the Battle of Derasge. His reign demonstrated the possibilities and limitations of Zemene Mesafint politics: he could defeat rivals but couldn't establish lasting legitimacy. His collaboration with Europeans foreshadowed Ethiopia's growing global engagement."
  },
  {
    "id": "p21",
    "name": "Tekle Giyorgis II",
    "title": "Emperor of Ethiopia",
    "period": "1868 - 1871",
    "location": [12.6, 37.4],
    "startYear": 1868,
    "endYear": 1871,
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQh_iRCuLk40ND0s37SeNsOChWnQpdljk-Amg&s",
    "summary": "Tekle Giyorgis II (c. 1836–1873), originally Wagshum Gobeze, seized power after Tewodros II's death but failed to reunify Ethiopia. Crowned in 1868, he faced immediate challenges: Egyptian expansion from the north, Menelik's growing power in Shewa, and British-supported rival claimants. His attempt to conquer Shewa failed when Menelik defeated him at the Battle of Assam (1871). He was overthrown by Kassa Mercha (Yohannes IV) and died in captivity. His brief reign highlighted post-Tewodros instability—four emperors in six years—until Yohannes established control. He represents the transitional figures who attempted but failed to consolidate power during Ethiopia's critical unification period."
  },
  {
    "id": "p22",
    "name": "Etege Taitu Bitul",
    "title": "Empress, Military Strategist",
    "period": "1851 - 1918",
    "location": [9.03, 38.74],
    "startYear": 1851,
    "endYear": 1918,
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQjoKZajd6VZgBeei1KcM78QcrRakqVUSPXCg&s",
    "summary": "Etege Taitu (1851–1918), Menelik II's wife, was Ethiopia's most politically active empress. Beyond court influence, she commanded her own army—the 'Adea' regiment—at Adwa and other campaigns. She personally negotiated with Italian diplomats, famously rejecting the controversial Article 17 of the Treaty of Wuchale. She founded Addis Ababa in 1886, choosing the site for its strategic location and hot springs. She established Ethiopia's first modern hospital (Menelik II Hospital) and promoted female education. Her intelligence network provided crucial information before Adwa. After Menelik's stroke (1906), she ruled as regent until forced out by rival nobles. Her legacy combines traditional authority with modern state-building."
  },
  {
    "id": "p23",
    "name": "Dejazmach Balcha Safo",
    "title": "Military Commander, Governor",
    "period": "1863 - 1936",
    "location": [7.85, 38.08],
    "startYear": 1863,
    "endYear": 1936,
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQB_beyN_mZSeY4W3aRmY5gxI3X4PYOPdIhKg&s",
    "summary": "Dejazmach Balcha Safo (c. 1863–1936), an Oromo commander, was one of Menelik II's most formidable generals, conquering southern regions and governing Sidamo for decades. At Adwa, his forces captured Italian artillery. His legendary 1928 rebellion against Ras Tafari (Haile Selassie) symbolized old guard resistance to centralization. Arriving in Addis Ababa with thousands of troops to challenge the regent, he was outmaneuvered politically and militarily at Anchem. Captured but pardoned, he retired until the Italian invasion, when the 73-year-old rejoined the defense. He died leading troops against Italians at the Battle of Ogaden (1936). His life spanned Ethiopia's transformation from feudal empire to modern state."
  },
  {
    "id": "p24",
    "name": "Ras Imru Haile Selassie",
    "title": "Prince, Patriot Leader",
    "period": "1892 - 1980",
    "location": [11.7, 37.93],
    "startYear": 1892,
    "endYear": 1980,
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSH5l1Zi-I1im51MMIikKopH2jeB8i9aFPifw&s",
    "summary": "Ras Imru (1892–1980), Haile Selassie's cousin, was a progressive aristocrat who served as prime minister (1957–1960) and diplomat. Educated in Lebanon and France, he modernized Ethiopia's legal system and advocated constitutional monarchy. During the Italian invasion, he commanded the northern front at the Battle of Shire (1936). Captured, he spent five years in Italian prisons. As post-war governor of several provinces, he implemented reforms. His brief prime ministership attempted to balance modernization with imperial authority. After the 1960 coup attempt, his influence declined. He survived the Derg's purges, dying under house arrest—a symbol of Ethiopia's enlightened aristocracy caught between tradition and change."
  },
  {
    "id": "p25",
    "name": "Abebe Aregai",
    "title": "Patriot Leader, Prime Minister",
    "period": "1903 - 1960",
    "location": [9.03, 38.74],
    "startYear": 1903,
    "endYear": 1960,
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRROYMU_dPPZUrTO3pvZDKqE3q_xp_Zw5hYjQ&s",
    "summary": "Abebe Aregai (1903–1960) rose from Shewan nobility to become Ethiopia's most successful Patriot leader during the Italian occupation (1936–1941). Operating from Ankober, his guerrilla forces tied down thousands of Italian troops. After liberation, he became minister of defense and Ethiopia's first native prime minister (1957–1960). He modernized the military, suppressed rebellions, and navigated Cold War politics. His assassination during the 1960 coup attempt—shot alongside other ministers at the Genetta Leul Palace—removed a stabilizing figure and accelerated political instability. He represents the generation that liberated Ethiopia and governed its early modernization, bridging the imperial and revolutionary eras."
  },
  {
    "id": "p26",
    "name": "Mengistu Neway",
    "title": "Revolutionary, Coup Leader",
    "period": "1919 - 1961",
    "location": [9.03, 38.74],
    "startYear": 1919,
    "endYear": 1961,
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQxUdf5NrOjH9rOd9LTNA-nl5df7CP6tLp4bQ&s",
    "summary": "Brigadier General Mengistu Neway (1919–1961) led the 1960 coup attempt against Haile Selassie while the emperor was abroad—the first serious challenge to the imperial system. As commander of the Imperial Bodyguard, he seized key installations and announced a 'progressive' government. The coup failed when the army and Church remained loyal. Captured and executed, he became a martyr for Ethiopia's revolutionary movements. His motivations—frustration with feudal remnants, corruption, and slow reform—anticipated the 1974 revolution. His brother Germame, the coup's ideological leader, also died. Their failed revolution revealed deep discontent that would erupt 14 years later in the Ethiopian Revolution."
  },
  {
    "id": "p27",
    "name": "Sultan Ali Mirah",
    "title": "Sultan of Afar",
    "period": "1927 - 2011",
    "location": [11.79, 41.01],
    "startYear": 1927,
    "endYear": 2011,
    "image": "https://i0.wp.com/www.ethiopiaobserver.com/wp-content/uploads/2020/09/EiWPOslWAAAkN7D.jpg?resize=960%2C450&ssl=1",
    "summary": "Sultan Ali Mirah Hanfare (1927–2011) ruled the Afar people for six decades, navigating Ethiopian imperial, Derg, and EPRDF regimes while preserving Afar autonomy. Crowned in 1944, he maintained traditional authority while modernizing education and infrastructure in the harsh Danakil Depression. He mediated between Ethiopia and Eritrea, used his French connections, and survived assassination attempts. Exiled during the Derg (1975–1991), he returned to help stabilize post-Derg Ethiopia. His leadership exemplified how Ethiopia's ethnic federations accommodated traditional rulers. He balanced loyalty to Ethiopia with advocacy for Afar interests regarding land rights, salt mining, and the Awash River—critical issues in one of Africa's most strategic regions."
  },
  {
    "id": "p28",
    "name": "Meles Zenawi",
    "title": "Prime Minister, Revolutionary",
    "period": "1955 - 2012",
    "location": [13.49, 39.47],
    "startYear": 1955,
    "endYear": 2012,
    "image": "https://ethiopianembassy.be/wp-content/uploads/2011/11/PM-Meles-Zenawi.jpg",
    "summary": "Meles Zenawi (1955–2012), born Legesse Zenawi, led the TPLF/EPRDF to victory in 1991, serving as Ethiopia's prime minister (1995–2012). A Marxist guerrilla turned developmental state advocate, he designed Ethiopia's ethnic federalism system. His policies achieved rapid economic growth (average 10% annually), infrastructure expansion, and poverty reduction, but also authoritarianism, human rights abuses, and ethnic tensions. He played key regional roles in Somalia and Sudan conflicts. His death in office created a leadership vacuum. Praised for economic development and criticized for democratic deficits, he shaped contemporary Ethiopia more than any leader since Haile Selassie, with a legacy still defining Ethiopia's trajectory."
  },
  {
    "id": "p29",
    "name": "Abuna Paulos",
    "title": "Patriarch of Ethiopian Orthodox Church",
    "period": "1935 - 2012",
    "location": [12.6, 37.4],
    "startYear": 1935,
    "endYear": 2012,
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQ6PZ9pcipjUJkqAYmnzosDZoOOh7qGW4C8GQ&s",
    "summary": "Abuna Paulos (1935–2012), born Gebre Medhin Wolde Yohannes, served as the fifth Patriarch of the Ethiopian Orthodox Tewahedo Church (1992–2012). Imprisoned by the Derg for seven years (1976–1983), he emerged to lead the Church's post-communist revival. He expanded theological education, built new churches, and increased global engagement while navigating church-state relations with the EPRDF government. He served as World Council of Churches president and promoted interfaith dialogue. His death marked the end of a generation that preserved Orthodoxy through persecution. He balanced traditional authority with modern challenges, maintaining the Church's central role in Ethiopian identity during rapid social change."
  },
  {
    "id": "p30",
    "name": "Tirunesh Dibaba",
    "title": "Olympic Athlete, National Icon",
    "period": "1985 - present",
    "location": [7.67, 36.83],
    "startYear": 1985,
    "endYear": null,
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRtbSMDpP4cfkxYocmPxGh5F7cxLHQHuqVgiQ&s",
    "summary": "Tirunesh Dibaba (born 1985), 'the Baby-Faced Destroyer,' is Ethiopia's most decorated Olympian with three gold medals (2008 5,000m & 10,000m, 2012 10,000m). Part of the legendary Dibaba running family from Bekoji, she dominated women's distance running for a decade, setting world records in 5,000m and 15km road race. Her epic 2008 Beijing 10,000m victory—a dramatic sprint finish after stumbling—became a national moment. Beyond athletics, she represents modern Ethiopia's global success, inspiring youth and women. Her career bridges Ethiopia's ancient athletic traditions with contemporary sporting excellence, demonstrating how individual achievement can build national pride in the 21st century."
  }
]